---
type: AirSystemData
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 10
tags: [revit-api, class]
---

# AirSystemData

`Autodesk.Revit.DB.Mechanical.AirSystemData` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | AirFanType | 2020.1 | `public AirFanType AirFanType { get ; set ; }` |
| Property | ChilledWaterLoopId | 2020.1 | `public ElementId ChilledWaterLoopId { get ; set ; }` |
| Property | CoolingCoilType | 2020.1 | `public AirCoolingCoilType CoolingCoilType { get ; set ; }` |
| Property | HeatExchangerType | 2020.1 | `public AirHeatExchangerType HeatExchangerType { get ; set ; }` |
| Property | HeatingCoilType | 2020.1 | `public AirHeatingCoilType HeatingCoilType { get ; set ; }` |
| Property | HeatingHotWaterLoopId | 2020.1 | `public ElementId HeatingHotWaterLoopId { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | PreheatCoilType | 2020.1 | `public AirHeatingCoilType PreheatCoilType { get ; set ; }` |
| Property | PreheatHotWaterLoopId | 2020.1 | `public ElementId PreheatHotWaterLoopId { get ; set ; }` |